---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DivisionRuleParam
source: html/2e4bba58-6b18-b254-bce5-7f049c27c46c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DivisionRuleParam Property

"Division Rule"

## Syntax (C#)
```csharp
public static ForgeTypeId DivisionRuleParam { get; }
```